content-org/languages/py.org
#+LAYOUT: docs-manual
#+TITLE: Python
#+SUMMARY: Children, script kiddies, data engineers, and grad students love Python!
#+hugo_base_dir: ../../
#+hugo_section: languages
#+hugo_custom_front_matter: :toc true :summary "Children, script kiddies, data engineers, and grad students love Python!"
#+hugo_custom_front_matter: :chapter true
#+hugo_custom_front_matter: :aliases '("/python" "/pyc" "/py" "/pip")
#+hugo_custom_front_matter: :warning "THIS FILE WAS GENERATED BY OX-HUGO, DO NOT EDIT!!!"
#+PROPERTY: header-args:python :exports both :eval yes :results value scalar
#+hugo_level_offset: 0

# pandoc -o content-org/languages/py.org --from=markdown --to=org  content/languages/py.markdown
# rm content/languages/py.markdown
* Hello Python
:PROPERTIES:
:CUSTOM_ID: hello-python
:END:
#+begin_src python
import antigravity
print("Hello, Python!")
#+end_src

* Why use Python?
:PROPERTIES:
:CUSTOM_ID: why-use-python
:END:
Easy for humans to read, easy to write c extensions, simple for
beginners, complex enough to enable machine learning.

/Stop here, this manual is incomplete!/ New sections will be filled out
soon, when I trace back my steps and re-learn the language properly. For
now, it is an empty shell. I focus primarily on *Python 3.X* in my
writing, though I originally learned Python 2.

Quality Assurance frequently requires one of the following:

1. Excel spreadsheet manipulation.
2. Clicking through user interfaces.
3. Writing documentation based on tabular system information.

All of these use cases can see fantastic acceleration with just a little
bit of automation. I leverage Pandas, Selenium, Docx and Xlrd, and other
modules to move data between Excel Spreadsheets, Word Documents, and
Selenium Actions.

* Environment Setup
:PROPERTIES:
:CUSTOM_ID: environment-setup
:END:
If running windows, you'll need the latest
[[https://www.python.org/downloads/][python installer]]. If on a
GNU/Linux distribution, you'll be able to install =python3-dev= with
your package manager; all tools will be installed automatically. Ensure
that you have the pip package manager installed by running =pip3 -v=.

Most of my python is written either in /VIM/ or /VS Code/ with the
[[https://marketplace.visualstudio.com/items?itemName=himanoa.Python-autopep8][AutoPEP8]]
linter. You'll need /pylint/ installed to use the VS Code extension.

#+begin_src sh
# Install whatever you want.
pip3 install --upgrade pip
pip3 install jupyter pylint pandas --user
# Ensure .local/bin is in your PATH.
#+end_src

* Recommended Learning Path
:PROPERTIES:
:CUSTOM_ID: recommended-learning-path
:END:
If programming for the very first time, I'd recommend taking
CodeCademy's [[https://www.codecademy.com/learn/learn-python-3][/Learn
Python 3/]] course, ignoring the Pro materials.

* Pandas Data Analysis
:PROPERTIES:
:CUSTOM_ID: pandas-data-analysis
:END:
/Pandas/ is a Python library for creating and manipulating /dataframes/,
allowing for easy organization and processing of data. Xlrd enables easy
import of excel files into Pandas Dataframe format, and manipulation is
easy from there.

** Excel Table Container
:PROPERTIES:
:CUSTOM_ID: excel-table-container
:END:
This simple container class holds a spreadsheet and make it easier to
access and manipulate individual sheets. It is part of =rcf_lib.py=

#+begin_src py
class TableGlob:

    filepath = ""

    def __init__(self, name):
        self.name = name

    def importExcelTable(self, filepath):
        if not self.filepath:
            if( os.path.isfile(str(filepath)) and str(filepath[-4:]) == 'xlsx'):
                dbg(e,"good","TblGlb","Data found, importing {0}...".format(filepath))
                self.tablefile = pd.ExcelFile(filepath)
                self.sheetlist = self.tablefile.sheet_names
                dbg(e,"good","TblGlb","Sheets: {0}".format(self.sheetlist))
                self.filepath = filepath
                return True
            else:
                dbg(e,"fail","TblGlb","Path incorrect or table invalid!")
                return False
        else:
            dbg(e,"fail","TblGlb","Table already imported!")
            return False

    def sheets(self):
        return self.sheetlist

    # Returns a pandas dataframe from the excel sheet specified.
    def getdf(self, sheetid):
        if str(sheetid) in self.sheetlist:
            return self.tablefile.parse(sheetid)

    # Mostly for ensuring import was successful.
    def dataShapeTuple(self):
        tuples = []
        for sheetid in self.sheetlist:
            temptable = self.getdf(str(sheetid))
            tuples.append((temptable.shape[0],temptable.shape[1]))

        dbg(e,"good","TblGlb","Data Shape (ROW,COL): {0}".format(tuples))
        return tuples
#+end_src

