content/languages/py.md
+++
title = "Python"
author = ["Ryan Fleck"]
draft = false
toc = true
summary = "Children, script kiddies, data engineers, and grad students love Python!"
chapter = true
aliases = ["/python", "/pyc", "/py", "/pip"]
warning = "THIS FILE WAS GENERATED BY OX-HUGO, DO NOT EDIT!!!"
+++

# Hello Python {#hello-python}

```python
import antigravity
print("Hello, Python!")
```


# Why use Python? {#why-use-python}

Easy for humans to read, easy to write c extensions, simple for
beginners, complex enough to enable machine learning.

_Stop here, this manual is incomplete!_ New sections will be filled out
soon, when I trace back my steps and re-learn the language properly. For
now, it is an empty shell. I focus primarily on **Python 3.X** in my
writing, though I originally learned Python 2.

Quality Assurance frequently requires one of the following:

1.  Excel spreadsheet manipulation.
2.  Clicking through user interfaces.
3.  Writing documentation based on tabular system information.

All of these use cases can see fantastic acceleration with just a little
bit of automation. I leverage Pandas, Selenium, Docx and Xlrd, and other
modules to move data between Excel Spreadsheets, Word Documents, and
Selenium Actions.


# Environment Setup {#environment-setup}

If running windows, you'll need the latest
[python installer](https://www.python.org/downloads/). If on a
GNU/Linux distribution, you'll be able to install `python3-dev` with
your package manager; all tools will be installed automatically. Ensure
that you have the pip package manager installed by running `pip3 -v`.

Most of my python is written either in _VIM_ or _VS Code_ with the
[AutoPEP8](https://marketplace.visualstudio.com/items?itemName=himanoa.Python-autopep8)
linter. You'll need _pylint_ installed to use the VS Code extension.

```sh
# Install whatever you want.
pip3 install --upgrade pip
pip3 install jupyter pylint pandas --user
# Ensure .local/bin is in your PATH.
```


# Recommended Learning Path {#recommended-learning-path}

If programming for the very first time, I'd recommend taking
CodeCademy's [_Learn
Python 3_](https://www.codecademy.com/learn/learn-python-3) course, ignoring the Pro materials.


# Pandas Data Analysis {#pandas-data-analysis}

_Pandas_ is a Python library for creating and manipulating _dataframes_,
allowing for easy organization and processing of data. Xlrd enables easy
import of excel files into Pandas Dataframe format, and manipulation is
easy from there.


## Excel Table Container {#excel-table-container}

This simple container class holds a spreadsheet and make it easier to
access and manipulate individual sheets. It is part of `rcf_lib.py`

```py
class TableGlob:

    filepath = ""

    def __init__(self, name):
        self.name = name

    def importExcelTable(self, filepath):
        if not self.filepath:
            if( os.path.isfile(str(filepath)) and str(filepath[-4:]) == 'xlsx'):
                dbg(e,"good","TblGlb","Data found, importing {0}...".format(filepath))
                self.tablefile = pd.ExcelFile(filepath)
                self.sheetlist = self.tablefile.sheet_names
                dbg(e,"good","TblGlb","Sheets: {0}".format(self.sheetlist))
                self.filepath = filepath
                return True
            else:
                dbg(e,"fail","TblGlb","Path incorrect or table invalid!")
                return False
        else:
            dbg(e,"fail","TblGlb","Table already imported!")
            return False

    def sheets(self):
        return self.sheetlist

    # Returns a pandas dataframe from the excel sheet specified.
    def getdf(self, sheetid):
        if str(sheetid) in self.sheetlist:
            return self.tablefile.parse(sheetid)

    # Mostly for ensuring import was successful.
    def dataShapeTuple(self):
        tuples = []
        for sheetid in self.sheetlist:
            temptable = self.getdf(str(sheetid))
            tuples.append((temptable.shape[0],temptable.shape[1]))

        dbg(e,"good","TblGlb","Data Shape (ROW,COL): {0}".format(tuples))
        return tuples
```
