content-org/languages/py.org
** Aggregation
:PROPERTIES:
:CUSTOM_ID: aggregation
:END:
#+begin_src python
# Up for breakfast?

pipeline = [
    {
        "$group":{
            "_id":"$type_of_food",
            "Average Rating":{"$avg":"$rating"},
            "Count":{"$sum":1}
        }
    },
    {
        "$sort":{
            # "Average Rating":-1,
            "Count": -1
        }
    }
]

agg = collection.aggregate(pipeline)
ratings = pd.DataFrame(list(agg))
ratings = ratings.set_index("_id")
ratings.head(10)
#+end_src

#+begin_html
  <style scoped>
      .dataframe tbody tr th:only-of-type {
          vertical-align: middle;
      }

      .dataframe tbody tr th {
          vertical-align: top;
      }

      .dataframe thead th {
          text-align: right;
      }

  </style>
#+end_html

#+begin_html
  <table border="1" class="dataframe">
#+end_html

#+begin_html
  <thead>
#+end_html

#+begin_html
  <tr style="text-align: right;">
#+end_html

#+begin_html
  <th>
#+end_html

#+begin_html
  </th>
#+end_html

#+begin_html
  <th>
#+end_html

Average Rating

#+begin_html
  </th>
#+end_html

#+begin_html
  <th>
#+end_html

Count

#+begin_html
  </th>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

_id

#+begin_html
  </th>
#+end_html

#+begin_html
  <th>
#+end_html

#+begin_html
  </th>
#+end_html

#+begin_html
  <th>
#+end_html

#+begin_html
  </th>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  </thead>
#+end_html

#+begin_html
  <tbody>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

Curry

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

5.036158

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

902

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

Pizza

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

4.914141

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

500

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

Chinese

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

4.893678

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

174

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

Kebab

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

4.885621

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

154

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

Fish & Chips

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

5.036697

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

116

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

American

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

4.617021

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

95

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

Turkish

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

4.918919

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

74

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

Lebanese

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

4.805970

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

70

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

Chicken

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

4.410000

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

53

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

Caribbean

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

4.583333

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

46

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  </tbody>
#+end_html

#+begin_html
  </table>
#+end_html

#+begin_src python
ratings.tail()
#+end_src

#+begin_html
  <style scoped>
      .dataframe tbody tr th:only-of-type {
          vertical-align: middle;
      }

      .dataframe tbody tr th {
          vertical-align: top;
      }

      .dataframe thead th {
          text-align: right;
      }

  </style>
#+end_html

#+begin_html
  <table border="1" class="dataframe">
#+end_html

#+begin_html
  <thead>
#+end_html

#+begin_html
  <tr style="text-align: right;">
#+end_html

#+begin_html
  <th>
#+end_html

#+begin_html
  </th>
#+end_html

#+begin_html
  <th>
#+end_html

Average Rating

#+begin_html
  </th>
#+end_html

#+begin_html
  <th>
#+end_html

Count

#+begin_html
  </th>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

_id

#+begin_html
  </th>
#+end_html

#+begin_html
  <th>
#+end_html

#+begin_html
  </th>
#+end_html

#+begin_html
  <th>
#+end_html

#+begin_html
  </th>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  </thead>
#+end_html

#+begin_html
  <tbody>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

Pasta

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

6.0

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

1

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

Cakes

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

5.5

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

1

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

Nigerian

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

4.5

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

1

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

Punjabi

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

6.0

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

1

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

Spanish

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

4.5

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

1

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  </tbody>
#+end_html

#+begin_html
  </table>
#+end_html

Well, that's pretty neat.

Another one:

#+begin_src python
pipeline = [
    {"$match": {"type_of_food":"Breakfast"}}
]

agg = collection.aggregate(pipeline)
breakfast = pd.DataFrame(list(agg))
breakfast
#+end_src

#+begin_html
  <style scoped>
      .dataframe tbody tr th:only-of-type {
          vertical-align: middle;
      }

      .dataframe tbody tr th {
          vertical-align: top;
      }

      .dataframe thead th {
          text-align: right;
      }

  </style>
#+end_html

#+begin_html
  <table border="1" class="dataframe">
#+end_html

#+begin_html
  <thead>
#+end_html

#+begin_html
  <tr style="text-align: right;">
#+end_html

#+begin_html
  <th>
#+end_html

#+begin_html
  </th>
#+end_html

#+begin_html
  <th>
#+end_html

URL

#+begin_html
  </th>
#+end_html

#+begin_html
  <th>
#+end_html

_id

#+begin_html
  </th>
#+end_html

#+begin_html
  <th>
#+end_html

address

#+begin_html
  </th>
#+end_html

#+begin_html
  <th>
#+end_html

address line 2

#+begin_html
  </th>
#+end_html

#+begin_html
  <th>
#+end_html

name

#+begin_html
  </th>
#+end_html

#+begin_html
  <th>
#+end_html

outcode

#+begin_html
  </th>
#+end_html

#+begin_html
  <th>
#+end_html

postcode

#+begin_html
  </th>
#+end_html

#+begin_html
  <th>
#+end_html

rating

#+begin_html
  </th>
#+end_html

#+begin_html
  <th>
#+end_html

type_of_food

#+begin_html
  </th>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  </thead>
#+end_html

#+begin_html
  <tbody>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

0

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

http://www.just-eat.co.uk/restaurants-133-take...

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

55f14312c7447c3da7051b36

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

133 Fullarton Street

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Irvine

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

133 Takeaway

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

KA12

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

8DG

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Not yet rated

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Breakfast

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

1

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

http://www.just-eat.co.uk/restaurants-alfiesca...

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

55f14312c7447c3da7051d66

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

161 Helen Street

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Glasgow

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Alfies Cafe - Collection Only

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

G51

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

3HD

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Not yet rated

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Breakfast

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

2

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

http://www.just-eat.co.uk/restaurants-alldaybr...

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

55f14312c7447c3da7051dc8

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

227 Lower House Lane

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Liverpool

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

All Day Breakfast Bar

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

L11

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

2SF

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

4.5

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Breakfast

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

3

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

http://www.just-eat.co.uk/restaurants-annescaf...

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

55f14312c7447c3da7051f27

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

64 Anne Road

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Smethwick

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Anne's Cafe

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

B66

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

2NY

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

5.5

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Breakfast

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

4

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

http://www.just-eat.co.uk/restaurants-benvenut...

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

55f14313c7447c3da70523b7

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Bell Parade

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

West Wickham

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Benvenuti - Collection Only

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

BR4

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

0RH

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Not yet rated

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Breakfast

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

5

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

http://www.just-eat.co.uk/restaurants-big-dadd...

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

55f14313c7447c3da7052475

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

2 Norris Street

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Cheshire

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Big Daddy House

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

WA2

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

7RL

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Not yet rated

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Breakfast

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  <tr>
#+end_html

#+begin_html
  <th>
#+end_html

6

#+begin_html
  </th>
#+end_html

#+begin_html
  <td>
#+end_html

http://www.just-eat.co.uk/restaurants-bigphill...

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

55f14313c7447c3da7052499

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Old Club Building

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Tyne and Wear

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Big Phil'lers Deli

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

NE27

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

0EP

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

5

#+begin_html
  </td>
#+end_html

#+begin_html
  <td>
#+end_html

Breakfast

#+begin_html
  </td>
#+end_html

#+begin_html
  </tr>
#+end_html

#+begin_html
  </tbody>
#+end_html

#+begin_html
  </table>
#+end_html

[[https://stackoverflow.com/questions/5723896/is-there-a-sample-mongodb-database-along-the-lines-of-world-for-mysql][This
Stack Overflow post]] should give you a good idea of how to import the
json on Windows and /nix./

