content/languages/py.md


## Aggregation {#aggregation}

```python
# Up for breakfast?

pipeline = [
    {
        "$group":{
            "_id":"$type_of_food",
            "Average Rating":{"$avg":"$rating"},
            "Count":{"$sum":1}
        }
    },
    {
        "$sort":{
            # "Average Rating":-1,
            "Count": -1
        }
    }
]

agg = collection.aggregate(pipeline)
ratings = pd.DataFrame(list(agg))
ratings = ratings.set_index("_id")
ratings.head(10)
```

<div class="html">

&lt;style scoped&gt;
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

.dataframe tbody tr th {
    vertical-align: top;
}

.dataframe thead th {
    text-align: right;
}

&lt;/style&gt;

</div>

<div class="html">

&lt;table border="1" class="dataframe"&gt;

</div>

<div class="html">

&lt;thead&gt;

</div>

<div class="html">

&lt;tr style="text-align: right;"&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

Average Rating

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

Count

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

\_id

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;/thead&gt;

</div>

<div class="html">

&lt;tbody&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

Curry

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

5.036158

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

902

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

Pizza

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

4.914141

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

500

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

Chinese

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

4.893678

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

174

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

Kebab

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

4.885621

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

154

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

Fish &amp; Chips

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

5.036697

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

116

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

American

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

4.617021

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

95

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

Turkish

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

4.918919

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

74

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

Lebanese

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

4.805970

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

70

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

Chicken

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

4.410000

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

53

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

Caribbean

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

4.583333

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

46

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;/tbody&gt;

</div>

<div class="html">

&lt;/table&gt;

</div>

```python
ratings.tail()
```

<div class="html">

&lt;style scoped&gt;
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

.dataframe tbody tr th {
    vertical-align: top;
}

.dataframe thead th {
    text-align: right;
}

&lt;/style&gt;

</div>

<div class="html">

&lt;table border="1" class="dataframe"&gt;

</div>

<div class="html">

&lt;thead&gt;

</div>

<div class="html">

&lt;tr style="text-align: right;"&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

Average Rating

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

Count

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

\_id

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;/thead&gt;

</div>

<div class="html">

&lt;tbody&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

Pasta

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

6.0

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

1

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

Cakes

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

5.5

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

1

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

Nigerian

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

4.5

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

1

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

Punjabi

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

6.0

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

1

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

Spanish

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

4.5

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

1

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;/tbody&gt;

</div>

<div class="html">

&lt;/table&gt;

</div>

Well, that's pretty neat.

Another one:

```python
pipeline = [
    {"$match": {"type_of_food":"Breakfast"}}
]

agg = collection.aggregate(pipeline)
breakfast = pd.DataFrame(list(agg))
breakfast
```

<div class="html">

&lt;style scoped&gt;
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

.dataframe tbody tr th {
    vertical-align: top;
}

.dataframe thead th {
    text-align: right;
}

&lt;/style&gt;

</div>

<div class="html">

&lt;table border="1" class="dataframe"&gt;

</div>

<div class="html">

&lt;thead&gt;

</div>

<div class="html">

&lt;tr style="text-align: right;"&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

URL

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

\_id

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

address

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

address line 2

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

name

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

outcode

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

postcode

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

rating

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

type_of_food

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;/thead&gt;

</div>

<div class="html">

&lt;tbody&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

0

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

<http://www.just-eat.co.uk/restaurants-133-take>...

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

55f14312c7447c3da7051b36

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

133 Fullarton Street

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Irvine

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

133 Takeaway

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

KA12

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

8DG

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Not yet rated

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Breakfast

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

1

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

<http://www.just-eat.co.uk/restaurants-alfiesca>...

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

55f14312c7447c3da7051d66

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

161 Helen Street

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Glasgow

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Alfies Cafe - Collection Only

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

G51

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

3HD

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Not yet rated

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Breakfast

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

2

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

<http://www.just-eat.co.uk/restaurants-alldaybr>...

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

55f14312c7447c3da7051dc8

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

227 Lower House Lane

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Liverpool

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

All Day Breakfast Bar

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

L11

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

2SF

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

4.5

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Breakfast

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

3

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

<http://www.just-eat.co.uk/restaurants-annescaf>...

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

55f14312c7447c3da7051f27

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

64 Anne Road

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Smethwick

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Anne's Cafe

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

B66

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

2NY

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

5.5

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Breakfast

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

4

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

<http://www.just-eat.co.uk/restaurants-benvenut>...

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

55f14313c7447c3da70523b7

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Bell Parade

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

West Wickham

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Benvenuti - Collection Only

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

BR4

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

0RH

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Not yet rated

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Breakfast

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

5

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

<http://www.just-eat.co.uk/restaurants-big-dadd>...

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

55f14313c7447c3da7052475

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

2 Norris Street

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Cheshire

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Big Daddy House

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

WA2

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

7RL

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Not yet rated

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Breakfast

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;tr&gt;

</div>

<div class="html">

&lt;th&gt;

</div>

6

<div class="html">

&lt;/th&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

<http://www.just-eat.co.uk/restaurants-bigphill>...

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

55f14313c7447c3da7052499

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Old Club Building

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Tyne and Wear

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Big Phil'lers Deli

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

NE27

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

0EP

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

5

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;td&gt;

</div>

Breakfast

<div class="html">

&lt;/td&gt;

</div>

<div class="html">

&lt;/tr&gt;

</div>

<div class="html">

&lt;/tbody&gt;

</div>

<div class="html">

&lt;/table&gt;

</div>

[This
Stack Overflow post](https://stackoverflow.com/questions/5723896/is-there-a-sample-mongodb-database-along-the-lines-of-world-for-mysql) should give you a good idea of how to import the
json on Windows and _nix._
