content/languages/py.md


# Deep Learning on Azure {#deep-learning-on-azure}

Microsoft now has free learning courses hosted on
<https://docs.microsoft.com/en-gb/learn/browse/?roles=developer>

One course is focused on using jupyter notebooks and pytorch with azure
containers.
<https://docs.microsoft.com/en-gb/learn/modules/interactive-deep-learning/index>


# Distribute your Python Software {#distribute-your-python-software}

[PyInstaller?](https://medium.com/dreamcatcher-its-blog/making-an-stand-alone-executable-from-a-python-script-using-pyinstaller-d1df9170e263)
